#pragma once
#include <iostream>
#include <windows.h>
#include <iomanip>
#include <string.h>
#include <string>
#include <memory>
#include <typeinfo>
#include"лекарства.h"
using namespace std;
//поиск по параметрам
void find_name() {//поиск по названию
	ifstream infile("Medicaments.txt");
	char name_find[12];
	char S[256] ;
	cout << "Введите название лекарства, информацию о котором хотите найти: ";
	cin >> name_find;
	int stop = 0;
	int count = 0;
	if (stop == 0) {
		cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
		cout << "Дата изготовления  |  Дата оконч. ср. годн.  |      Название      | Метод применения    | Возраст прим. |  Показания к применению  | Формаколог. группа | Побоч. эффекты    | Форма выпуска  |\n";
		cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
		while (!infile.eof()) {

			infile.getline(S, 256);
			if (strstr(S, name_find)) {
				count++;
				cout << S << endl;
				cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
				
			}
		}
		
	}
	if(count ==0) {
			cout << "\nВ аптеке нет такого лекарственного препарата" << endl;
		}
}

//поиск по показанию к применению
void find_indication_for_use() {
	
		ifstream infile("Medicaments.txt");
		char indication_for_use_find[12];
		char S[256];
		cout << "Введите показание к применению, информацию о котором хотите найти: ";
		cin >> indication_for_use_find;
		int stop = 0;
		if (stop == 0) {
			cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
			cout << "Дата изготовления  |  Дата оконч. ср. годн.  |      Название      | Метод применения    | Возраст прим. |  Показания к применению  | Формаколог. группа | Побоч. эффекты    | Форма выпуска  |\n";
			cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
			while (!infile.eof()) {

				infile.getline(S, 256);
				if (strstr(S, indication_for_use_find)) {
					cout << S << endl;
					cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
					stop = 1;
				}
			}
		}
		else {
			cout << "В аптеке нет такого лекарственного препарата" << endl;
		}
	
}

//поиск по формакологической группе
void find_formacol_group() {

	ifstream infile("Medicaments.txt");
	char formacol_group_find[12];
	char S[256];
	cout << "Введите формакологическую группу, информацию о котором хотите найти: ";
	cin >> formacol_group_find;
	int stop = 0;
	if (stop == 0) {
		cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
		cout << "Дата изготовления  |  Дата оконч. ср. годн.  |      Название      | Метод применения    | Возраст прим. |  Показания к применению  | Формаколог. группа | Побоч. эффекты    | Форма выпуска  |\n";
		cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
		while (!infile.eof()) {

			infile.getline(S, 256);
			if (strstr(S, formacol_group_find)) {
				cout << S << endl;
				cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
				stop = 1;
			}
		}
	}
	else {
		cout << "В аптеке нет такого лекарственного препарата" << endl;
	}

}

//вывод из файла
void  output_file() {
	ifstream infile("Medicament.txt");
	cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
	cout << "Дата изготовления  |  Дата оконч. ср. годн.  |      Название      | Метод применения    | Возраст прим. |  Показания к применению  | Формаколог. группа | Побоч. эффекты    | Форма выпуска  |\n";
	cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
	infile.open("Medicaments.txt", ios::out);
	char S[256] = { "" };
	while (!infile.eof()) {
		infile.getline(S, 256);
		cout.setf(ios::left);

		cout << S << endl;
		cout << "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n";
	}
}